IDENTIFICATION DIVISION.
PROGRAM-ID. EXEC_DISTRIB.
AUTHOR KAUE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

    SELECT ARQ-VENDEDOR ASSIGN TO DISK WID-ARQ-VENDEDOR
		ORGANIZATION MODE    IS INDEXED
		ACCESS MODE          IS DYNAMIC
		RECORD KEY           IS ARQV-COD-VENDEDOR
		LOCK MODE            IS MANUAL
		FILE STATUIS         IS WS-RESULTADO-ACESSO
		
    SELECT ARQ-CLIENTE ASSIGN TO DISK WID-ARQ-CLIENTE
		ORGANIZATION MODE    IS INDEXED
		ACCESS MODE          IS DYNAMIC
		RECORD KEY           IS ARQC-COD-CLIENTE
		LOCK MODE            IS MANUAL
		FILE STATUIS         IS WS-RESULTADO-ACESSO		
		
    SELECT ARQ-VEND-CLI ASSIGN TO DISK WID-ARQ-VEND-CLI
		ORGANIZATION MODE    IS INDEXED
		ACCESS MODE          IS DYNAMIC
		RECORD KEY           IS ARQVC-COD-VENDEDOR
		LOCK MODE            IS MANUAL
		FILE STATUIS         IS WS-RESULTADO-ACESSO			
			 
DATA DIVISION.
   FILE SECTION.
   
   FD ARQ-VENDEDOR.
    01 ARQV-REGISTRO.
       03 ARQV-COD-VENDEDOR   PIC 9(07) VALUE ZEROS.
	   03 ARQV-CPF-VENDEDOR   PIC 9(14) VALUE ZEROS.
	   03 ARQV-NM-VENDEDOR    PIC X(40) VALUE SPACES.
	   03 ARQV-LAT-VENDEDOR   PIC S9(03)V9(08).
	   03 ARQV-LONG-VENDEDOR  PIC S9(03)V9(08).

   FD ARQ-CLIENTE.
    01 ARQC-REGISTRO.
       03 ARQC-COD-CLIENTE    PIC 9(07) VALUE ZEROS.
	   03 ARQC-CNPJ-CLIENTE   PIC 9(14) VALUE ZEROS.
	   03 ARQC-RAZAO-SOCIAL   PIC X(40) VALUE SPACES.
	   03 ARQC-LAT-CLIENTE    PIC S9(03)V9(08).
	   03 ARQC-LONG-CLIENTE   PIC S9(03)V9(08).

   FD ARQ-VEND-CLI.
    01 ARQVC-REGISTRO.
       03 ARQVC-COD-VENDEDOR  PIC 9(07) VALUE ZEROS.	
	   03 ARQVC-COD-CLIENTE   PIC 9(07) VALUE ZEROS.
	   03 ARQVC-RAZAO-SOCIAL  PIC X(40) VALUE SPACES.
	   03 ARQVC-LATITUDE      PIC S9(03)V9(08).
	   03 ARQVC-LONGITUDE     PIC S9(03)V9(08).	   
	
   WORKING-STORAGE SECTION.
   
    01 WS-MENSAGEM         PIC X(80) VALUE SPACES.
	01 WS-RESULTADO-ACESSO PIC 9(04) VALUE ZEROS.

   LINKAGE SECTION.
    01 LNK-STATUS   PIC 9(04).
	01 LNK-DADOS    PIC X(80).
	
PROCEDURE DIVISION.

    PERFORM 0100-INICIALIZACAO.
    PERFORM 0200-PROCESSAMENTO
    PERFORM 0300-FINALIZACAO.

0100-INICIALIZACAO      SECTION.
0100-01.	
    
	MOVE ZEROS TO WRK-COD-VENDEDOR
	MOVE ZEROS TO WRK-COD-CLIENTE
	
	OPEN INPUT ARQ-CLIENTE.
	IF WS-FILE-STATUS NOT EQUAL ZEROS
	   MOVE "ERRO AO ABRIR ARQUIVO DE CLIENTES" TO WS-MENSAGEM
	   EXIT SECTION
	END-IF.

	OPEN INPUT ARQ-VENDEDOR.
	IF WS-FILE-STATUS NOT EQUAL ZEROS
	   MOVE "ERRO AO ABRIR ARQUIVO DE VENDEDORES" TO WS-MENSAGEM
	   EXIT SECTION
	END-IF.	
	
	OPEN OUTPUT ARQ-VEND-CLI.
	IF WS-FILE-STATUS NOT EQUAL ZEROS
	   MOVE "ERRO AO ABRIR ARQUIVO DE CARTEIRA DE CLIENTES" TO WS-MENSAGEM
	   EXIT SECTION
	END-IF.

0100-EXIT.
    EXIT.

0200-PROCESSAMENTO       SECTION.
0200-1.
    
	START ARQ-VENDEDOR KEY NOT LESS WRK-COD-VENDEDOR
	IF WS-FILE-STATUS NOT EQUAL ZEROS
	   MOVE "ERRO AO INICIALIZAR ARQUIVO DE VENDEDORES" TO WS-MENSAGEM
	   EXIT SECTION
	END-IF.
	PERFORM 0210-DISTRIBUICAO UNTIL WS-FIM-DISTRIB.

0200-EXIT.
    EXIT.

0210-DISTRIBUICAO        SECTION.
0210-1.

    READ ARQ-VENDEDOR NEXT
	IF  WS-FILE-STATUS EQUAL ZEROS
	    START ARQ-CLIENTE KEY NOT LESS WRK-COD-CLIENTE
		PERFORM 0211-VERIFICA-CLIENTE UNTIL WS-FILE-STATUS NOT EQUAL ZEROS
	    MOVE ZEROS TO WS-FILE-STATUS
    ELSE
        MOVE "S"   TO WS-FIM-DISTRIB
    END-IF.		

0210-EXIT.
    EXIT.
	
0211-VERIFICA-CLIENTE    SECTION.
0211-1.

    READ ARQ-CLIENTE NEXT
	IF    WS-FILE-STATUS     EQUAL ZEROS
	 AND (ARQV-LAT-VENDEDOR  EQUAL ARQC-LAT-CLIENTE
	  OR  ARQV-LONG-VENDEDOR EQUAL ARQC-LONG-CLIENTE)
	      MOVE ARQV-COD-VENDEDOR   TO ARQVC-COD-VENDEDOR
		  MOVE ARQC-COD-CLIENTE    TO ARQVC-COD-CLIENTE
		  ARQC-RAZAO-SOCIAL        TO ARQVC-RAZAO-SOCIAL
		  MOVE ARQV-LAT-VENDEDOR   TO ARQVC-LATITUDE
		  MOVE ARQV-LONG-VENDEDOR  TO ARQVC-LONGITUDE
		  WRITE ARQVC-REGISTRO
		  IF  WS-FILE-STATUS NOT EQUAL ZEROS
		      MOVE "ERRO AO GRAVAR CARTEIRA DE CLIENTES" TO WS-MENSAGEM
			  EXIT SECTION
		  END-IF
	END-IF.
	
0211-EXIT.
    EXIT.
	
0300-FINALIZACAO         SECTION.
0300-1.
     
	CLOSE ARQ-CLIENTE.
	CLOSE ARQ-VENDEDOR.
	CLOSE ARQ-VEND-CLI.
	EXIT PROGRAM.

0300-EXIT.
    EXIT.	
	